# Lab 2 - Rectangular data and Pandas

## Purpose
Give an introduction to  
* Jupyter Notebook
* Rectangular data
* Variables and records
* Independent and dependent variables
* Pandas and Numpy Libraries
* Exploratory Data Analysis

## Methodology
We will be using the Pandas library to load a dataset, perform operation and conduct some data analysis. Some challenges are presented at the end.

## Results
Some knowledge on how to load, write and manipulate rectangular data in Python. First hands on real data. 

## Suggested next steps
Explore different types of data visualizations. Check [Python Graph Gallery](https://www.python-graph-gallery.com/) for ideas. This will be the topic of next week.

# Jupyter Notebooks

Anaconda will be our preference as a Python environment manager. If you haven't done it already, [install](https://www.anaconda.com/) it and follow the `intructions.md` file of the first week (available in moodle).

Jupyter Lab/Notebooks will be our IDE of preference.

Jupyter Notebooks are composed by Cells.

Cells can be either Markdown or Code.  

- Markdown cells allows us to write text, formulae, add images and explain things in the same way we would do in a normal notebook. Here is a [cheat sheet](https://guides.github.com/pdfs/markdown-cheatsheet-online.pdf) for Markdown Sintax.

- Code Cells allows us to execute code. 

Here is a Jupyter Notebook commands [cheat sheet](https://www.edureka.co/blog/wp-content/uploads/2018/10/Jupyter_Notebook_CheatSheet_Edureka.pdf) although you can also use the Help tab.

Useful Jupyter Notebook shortcuts:
- Esc and Enter to toggle between edit mode (notice how the colour of the cell on the left changes)
- A - new cell after current cell
- B - new cell before current cell
- Shit + Enter - execute cell and go to the next
- Ctrl + Enter - execute cell and remain on current
- DD - delete cell
- Z  - undo deleted

## Numpy

In [1]:
import numpy as np

Numpy is the core library for scientific computing in Python. It provides a high-performance multidimensional array object, and tools for working with these arrays. Also, it offers comprehensive mathematical functions, random number generators, linear algebra routines, Fourier transforms, and more.

## Before moving forward

Consider the cosine similarity function we build from scrach last week:

$$
  cos(v1, v2) = \frac{v1 . v2}{\lVert v1 \rVert \times \lVert v2 \rVert}
$$  

Explore Numpy functions `linalg.norm` e `dot` and re-write the above function without using a `for` loop.

In [2]:
v1 = [1,2,3,4]
v2 = [3,2,5,4]

# Your code here

In [3]:
# Solution

v1 = [1,2,3,4]
v2 = [3,2,5,4]

print(np.dot(v1,v2))
print(np.linalg.norm(v1)*np.linalg.norm(v2))

def cos(v1,v2):
  return np.dot(v1,v2)/(np.linalg.norm(v1)*np.linalg.norm(v2))

cos(v1,v2)

38
40.24922359499622

0.9441175904999112

## Rectangular data

A lot of the datasets we study in Data Science are rectangular, like a spreadsheet or database table. This means that we have a  `n` and `m` columns.

* A **column** in the table is commonly referred to as a **variable**. 
    * You may also see them refered as: attribute, input, predictor or feature
* A **row** in the table is commonly referred to as a **record**.
    * You may also see them refered as: case, example, instance, observation, pattern or sample


<details>
<p>

> Rectangular data is essentially a two-dimensional matrix with rows indicating records and columns indicating variables
> -- <cite>[Peter Bruce, Andrew Bruce @ Practical Statistics for Data Scientists][3]</cite>

[3]: https://www.oreilly.com/library/view/practical-statistics-for/9781491952955/ch01.html

</p>
</details>

What are independent and dependent variables?  

<details>
<p>
    
- An **independent variable** is the variable that is changed or controlled in a scientific experiment to test the effects on the dependent variable.  
    
- A **dependent variable** is the variable being tested and measured in a scientific experiment.
    
</p>
</details>

Very often what we want to do in data science is to explain how the independent variables can control the dependent variable.

What other names are given to these variables? 

<details>
<p>

> an **independent variable** is sometimes called a "predictor variable", regressor, covariate, "manipulated variable", "explanatory variable", exposure variable (see reliability theory), "risk factor" (see medical statistics), "feature" (in machine learning and pattern recognition) or "input variable".
> -- <cite>[Wikipedia][4]</cite>
    
> a **dependent variable** is sometimes called a "response variable", "regressand", "criterion", "predicted variable", "measured variable", "explained variable", "experimental variable", "responding variable", "outcome variable", "output variable", "target" or "label".
> -- <cite>[Wikipedia][4]</cite>

[4]: https://en.wikipedia.org/wiki/Dependent_and_independent_variables#Statistics_synonyms

 
    
</p>
</details>

## Pandas

In [4]:
import pandas as pd

What is Pandas?

<details>
<p>

> Pandas is seriously a game changer when it comes to cleaning, transforming, manipulating and analyzing data. In simple terms, Pandas helps to clean the mess 
> -- <cite>[Admond Lee][1]</cite>

[1]: https://towardsdatascience.com/why-and-how-to-use-pandas-with-large-data-9594dda2ea4c

</p>
</details>

Have a look at the Pandas documentation 

<details>
<p>

> `pandas` is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.
> -- <cite>[pandas library][2]</cite>

[2]: https://pandas.pydata.org/

</p>

### Lets use Pandas to create a retangular dataset

The DataFrame object is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table. It is generally the most commonly used pandas object.

#### Constructing DataFrame

A Pandas DataFrame can be constructed in a variety of ways.

One of them is from a list of dicts:

In [5]:
pd.DataFrame([{'a': i, 'b': 2 * i} for i in range(3)])

   a  b
0  0  0
1  1  2
2  2  4

In [41]:
data = pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])
data

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

A DataFrame object has has an index and column attribute

In [7]:
data.index

RangeIndex(start=0, stop=2, step=1)

In [8]:
data.columns

Index(['a', 'b', 'c'], dtype='object')

Note that the columns were defined by the dictionary keys

In [42]:
# these can be changed

data.rename(columns = {'a':'data', 'b':'science'}, inplace = True)
data

   data  science    c
0   1.0        2  NaN
1   NaN        3  4.0

#### Creating your own DataFrame

Before learning more details and operations on DataFrames, lets create our own.

In [43]:
name_list = ['ana', 'bruno', 'carlos']
shoe_list = [38, 39, 42]
height_list = [168, 170, 174]
gender_list = ['female', 'male', 'male']

students_df = pd.DataFrame({'name': name_list, 'shoe': shoe_list, 'height': height_list})
students_df

     name  shoe  height
0     ana    38     168
1   bruno    39     170
2  carlos    42     174

In [48]:
students_df.columns

Index(['name', 'shoe', 'height', 'gender'], dtype='object')

In [49]:
students_df.index

RangeIndex(start=0, stop=3, step=1)

In [44]:
# We forgot the gender data. This is how we can add a new column to the DataFrame 
students_df['gender'] = gender_list
students_df

     name  shoe  height  gender
0     ana    38     168  female
1   bruno    39     170    male
2  carlos    42     174    male

In [47]:
# We may have also introduced a wrong value. We can access it or change it using loc

students_df.loc[2, 'shoe'] = 43
students_df

     name  shoe  height  gender
0     ana    38     168  female
1   bruno    39     170    male
2  carlos    43     174    male

## Write and Read a csv file

We can use Pandas to perform both operations.
Run the cell below and check on your folder if the file was created.

In [62]:
# write a DataFrame as a csv file 
students_df.to_csv('data/students.csv')

In [64]:
# read a csv file into a DataFrame
students_df2 = pd.read_csv('data/students.csv')

In [55]:
students_df2.equals(students_df)

False

In [65]:
students_df2

   Unnamed: 0    name  shoe  height  gender
0           0     ana    38     168  female
1           1   bruno    39     170    male
2           2  carlos    43     174    male

In [67]:
students_df2 = pd.read_csv('data/students.csv', index_col=0)

In [68]:
students_df2.equals(students_df)

True

## Operations on pandas DataFrames

In this section you will learn about some DataFrame methods like `head` and `tail`.

### Subset of rows (records)

#### Select the first n rows

In [14]:
n = 2
students_df.head(n)

    name  shoe  height  gender
0    ana    38     168  female
1  bruno    39     170    male

#### Select the last rows

In [15]:
students_df.tail(n)

     name  shoe  height gender
1   bruno    39     170   male
2  carlos    42     174   male

#### Get a random sample of n rows

In [16]:
students_df.sample(n)

     name  shoe  height  gender
2  carlos    42     174    male
0     ana    38     168  female

#### Select rows by position

In [17]:
students_df.iloc[1:3]

     name  shoe  height gender
1   bruno    39     170   male
2  carlos    42     174   male

note: the Pandas Python library provides two data access methods

* `.loc` refers to the label index.
* `.iloc` refers to the positional index.

#### Select rows that meet logical criteria

In [18]:
# in this example all students with height of 170cm or higher
students_df[students_df['height'] >= 170]

     name  shoe  height gender
1   bruno    39     170   male
2  carlos    42     174   male

#### Select rows based on multiple conditions

In [19]:
# all male students with height of 172cm or higher
students_df[(students_df.gender == 'male') & (students_df.height >= 172)]

     name  shoe  height gender
2  carlos    42     174   male

In [20]:
# all female students or students with height of 172cm or higher
students_df[(students_df.gender == 'female') | (students_df.height >= 172)]

     name  shoe  height  gender
0     ana    38     168  female
2  carlos    42     174    male

### Subset of columns (variables)

#### Select columns by name

In [21]:
# single column
students_df['name']
# or
students_df.name # this one only works if the column name has no white spaces

0       ana
1     bruno
2    carlos
Name: name, dtype: object

In [22]:
# multiple columns
students_df[['name', 'gender']]

     name  gender
0     ana  female
1   bruno    male
2  carlos    male

#### Select columns by position

In [23]:
students_df.iloc[:, [0, 2]]

     name  height
0     ana     168
1   bruno     170
2  carlos     174

### Subset of both rows and columns

In [24]:
students_df.loc[students_df['shoe'] > 40, ['name', 'shoe']]

     name  shoe
2  carlos    42

### Summing Up

* When selecting subsets of data, square brackets `[]` are used.
* Inside these brackets, you can use a single column/row label, a list of column/row labels, a slice of labels, a conditional expression or a colon.
* Select specific rows and/or columns using **loc** when using the row and column names.
* Select specific rows and/or columns using **iloc** when using the positions in the table.
* You can assign new values to a selection based on **loc/iloc**.

[This](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf) Pandas Cheat Sheet might come in handy.

## Challenges 

In these challenges you will handle a bigger dataset.

There are a few first questions you need to know how to answer before reading a CSV file with Pandas

- Does the CSV have a header line?
- Is there an index column? 
- What is the separator character on the CSV file? 
- If there are missing values, is there any specific word being used to describe a missing value? 

Then, these details can be handled by specifing some parameters as `sep`, `na_values` or `index_col`.

### Challenge 1 - Load the Titanic dataset

In [25]:
# Your code here

In [69]:
# Solution

filepath = 'data/titanic-dataset.csv'
df_titanic = pd.read_csv(filepath, sep=',', na_values='')
df_titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### Challenge 2 - Validate the loading

1. Show the first 10 rows and confirm if the table matches with the lines
2. Try the DataFrame method `info`. It is a nice alternative. What information do you get from this?

In [ ]:
# Your code here

In [ ]:
# Your code here

In [28]:
# Solution 1

df_titanic.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [29]:
# Solution 2

df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Challenge 3 - Some basic EDA

EDA stands for exploratory data analysis. It is used by data scientists to analyze and investigate data sets and summarize their main characteristics, often employing data visualization methods.

Try executing `df_titanic.describe()`. After investigating the results, describe them and comment on the usefulness of this Pandas function.

In [ ]:
# Your code here

In [ ]:
# Your comments here

In [31]:
# Solution 1

df_titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [70]:
# Solution 2

pd.DataFrame.describe?

### Challenge 4 - Getting to know your data

What do the results above tell you about each variable? Do you actually now what they mean?

This is a crutial step. For info on this dataset click [here](https://www.kaggle.com/competitions/titanic/data?select=train.csv).

In [ ]:
# Your comments here

### Additional Challenge

This challenge is solved to help you get familiar with the most important object of the NumPy library, the array.

### Part I

1. Use the numpy's function `arange` and create the array `my_array` with the sequence of numbers from 0 to 24.

2. Use the method `reshape` to redimension the array so that it has 6 rows and 5 columns. What happened? What is the relasionship between the number of elements and the dimensions of a 2D matrix?

In [33]:
my_array = np.arange(24).reshape((6,4))
my_array

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

###  Part II

$$\begin{bmatrix} 
1 & 2 & 1 & 7 \\ 
3 & 0 & 1 & 8 \\ 
0 & 2 & 4 & 9 \\ 
2 & 2 & 5 & 5
\end{bmatrix}$$

1. Create this matrix in NumPy
2. Slice the first column
3. Slice the first column, but only the second and third rows
4. Slice the 4 elements at the center of the matrix
5. Slice the sub-matrix of the 4 elements of the lower right corner, without using the matrix size
6. Slice the sub-matrix of the 4 elements of the upper right corner, without using the matrix size

In [71]:
# Pergunta 3.1: criação da matriz como objeto de numpy
m = np.array(
    [[1,2,1,7],
    [3,0,1,8],
    [0,2,4,9],
    [2,2,5,5]]
)

# Pergunta 3.2: primeira coluna, 
# não há necessidade de saber as dimensões da matriz
print('first column: \n', m[:,0], '\n')

# Pergunta 3.3: slice primeira coluna mas so as filas 2 e 3
# não há necessidade de saber as dimensões da matriz
print('first column, rows 2 and 3: \n', m[1:3,0], '\n')

# Pergunta 3.4: slice os quatro elementos no centro da matriz
# este slice usa o conhecimento do tamanho da matriz
# no caso geral será necessário escrever uma função que determine
# o slice
print('centre: \n', m[1:3,1:3], '\n')

# Pergunta 3.5: slice a sub-matriz dos quatro elementos no canto inferior 
# direito, sem usar o tamanho da matriz.
# esta versão não cumpre o requerimento, porque conta desde o início da matriz
# e portanto está a usar informação do tamanho da mesma para atingir o
# objetivo
print('bottom right: \n', m[2:,2:], '\n')


# Pergunta 3.5: slice a sub-matriz dos quatro elementos no canto inferior 
# direito, sem usar o tamanho da matriz.
# esta versão sim cumpre o requerimento, porque define o slice desde o fim
# da matriz
print('bottom right: \n', m[-2:,-2:], '\n')

# Pergunta 3.6: slice a sub-matriz dos quatro elementos no canto inferior 
# direito, sem usar o tamanho da matriz.

# esta versão usa informação do tamanho da matriz para definir a seleção
# de colunas
print('top right: \n', m[:2,2:], '\n')

# esta versão cumpre o requerimento
print('top right: \n', m[:-2,-2:], '\n')

# esta versão cumpre o requerimento
print('top right: \n', m[:2,-2:], '\n')

first column:
 [1 3 0 2]

first column, rows 2 and 3:
 [3 0]

centre:
 [[0 1]
 [2 4]]

bottom right:
 [[4 9]
 [5 5]]

bottom right:
 [[4 9]
 [5 5]]

top right:
 [[1 7]
 [1 8]]

top right:
 [[1 7]
 [1 8]]

top right:
 [[1 7]
 [1 8]]